## 1. 판다스 데이터구조

## 2. 시리즈와 데이터프레임

### 시리즈

In [5]:
#라이브러리 불러오기
import pandas as pd
sd1 = pd.Series(['Dog','Cat','Tiger','Lion','Monkey'],index=['0','1', '2','3','4']) 

#시리즈데이터 출력
sd1

0       Dog
1       Cat
2     Tiger
3      Lion
4    Monkey
dtype: object

### 시리즈 - 1) 딕셔너리

In [1]:
import pandas as pd
#딕셔너리로 Series 생성
dict_data = {'a':1,'b':2,'c':3}
sd2 = pd.Series(dict_data)

#타입 확인
type(sd2)

pandas.core.series.Series

In [2]:
#시리즈데이터 출력
sd2

a    1
b    2
c    3
dtype: int64

### 시리즈 - 2) 리스트

In [3]:
import pandas as pd

#리스트로 Series 생성
list_data = pd.Series(['Dog','Cat','Tiger','Lion','Monkey'],index=['0','1', '2','3','4']) 
sd3= pd.Series(list_data)

#데이터 확인
sd3

0       Dog
1       Cat
2     Tiger
3      Lion
4    Monkey
dtype: object

### 시리즈 - 3) 튜플

In [4]:
import pandas as pd
#튜플로 Series 생성
tup_data = ('이순신','1991-03-15','남')
sd4 = pd.Series(tup_data, index = ['이름','생년월일','성별'])

#데이터 확인
sd4

이름             이순신
생년월일    1991-03-15
성별               남
dtype: object

### 데이터프레임

### 데이터프레임- 1) 딕셔너리

In [5]:
#라이브러리 불러오기
import pandas as pd

#딕셔너리로로 데이터프레임 생성
dict_data = {'동물':['Dog','Cat','Tiger','Lion','Monkey'],'나이':[7,9,2,3,1]}
df1 = pd.DataFrame(dict_data)

#타입 확인
print(type(df1))

#데이터 확인
print(df1)

<class 'pandas.core.frame.DataFrame'>
       동물  나이
0     Dog   7
1     Cat   9
2   Tiger   2
3    Lion   3
4  Monkey   1

### 데이터프레임 - 2) 리스트

In [6]:
#라이브러리 불러오기
import pandas as pd

#리스트로 데이터프레임 생성
df2 = pd.DataFrame([['Dog','7'], ['Cat','9'], ['Tiger','2'], ['Lion','3'],['Monkey','1']],
                  index = ['0','1','2','3','4'],
                  columns = ['동물','나이'])

#타입 확인
print(type(df2))
#데이터 확인
print(df2)

<class 'pandas.core.frame.DataFrame'>
       동물 나이
0     Dog  7
1     Cat  9
2   Tiger  2
3    Lion  3
4  Monkey  1

## 3. 데이터프레임 조작

### 1) 데이터 요약 보기

In [3]:
# 관련 라이브러리 불러오기
import pandas as pd           #판다스
import matplotlib as mpl       #맷플롭립
import matplotlib.pylab as plt   #맷플롭립
import seaborn as sns          #시본 
import numpy as np           #넘파이

#데이터 준비 시본에 내장된 팁 데이터 
tips = sns.load_dataset("tips")    # 팁 데이터
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [33]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
smoker_str    244 non-null category
dtypes: category(5), float64(2), int64(1)
memory usage: 7.6 KB

#### 2) 행 상하위 데이터 추출

In [34]:
#데이터프레임에서 BM' 열의 상위 5개 데이터 추출
tips.head()

   total_bill   tip     sex smoker  day    time  size smoker_str
0       16.99  1.01  Female     No  Sun  Dinner     2         No
1       10.34  1.66    Male     No  Sun  Dinner     3         No
2       21.01  3.50    Male     No  Sun  Dinner     3         No
3       23.68  3.31    Male     No  Sun  Dinner     2         No
4       24.59  3.61  Female     No  Sun  Dinner     4         No

In [35]:
#데이터프레임에서 BM' 열의 상위 2개 데이터 추출
tips.head(2)

   total_bill   tip     sex smoker  day    time  size smoker_str
0       16.99  1.01  Female     No  Sun  Dinner     2         No
1       10.34  1.66    Male     No  Sun  Dinner     3         No

In [36]:
#데이터프레임에서 열의 하위 데이터 추출
tips.tail()

     total_bill   tip     sex smoker   day    time  size smoker_str
239       29.03  5.92    Male     No   Sat  Dinner     3         No
240       27.18  2.00  Female    Yes   Sat  Dinner     2        Yes
241       22.67  2.00    Male    Yes   Sat  Dinner     2        Yes
242       17.82  1.75    Male     No   Sat  Dinner     2         No
243       18.78  3.00  Female     No  Thur  Dinner     2         No

In [37]:
#데이터프레임에서 BMI '' 열의 하위 3개 데이터 추출
tips.tail(3)

     total_bill   tip     sex smoker   day    time  size smoker_str
241       22.67  2.00    Male    Yes   Sat  Dinner     2        Yes
242       17.82  1.75    Male     No   Sat  Dinner     2         No
243       18.78  3.00  Female     No  Thur  Dinner     2         No

### 행 데이터

#### loc와 iloc 인덱스와 행번호란?

In [22]:
tips1 = tips.drop([2]) 
tips1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[243 rows x 7 columns]

In [23]:
tips1.iloc[2]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [24]:
tips1.loc[2]

KeyError: 2

In [ ]:
#데이터프레임의 기본 정보 확인 
tips.info()

#### 1) 인덱스 읽기

In [10]:
#데이터프레임에서 프레임에서 인덱스가 0인 데이터 추출 
tips.loc[0]

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [11]:
#1, 3, 5 인덱스의 데이터를 한꺼번에 가져오기
tips.loc[[1,3,5]]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4

#### 2) 행번호 읽기

In [12]:
#데이터 프레임에서 0번째 행 데이터 추출
tips.iloc[0]

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [13]:
 #-1을 사용하여 마지막 행 데이터를 추출한 예제
tips.iloc[-1]

total_bill     18.78
tip                3
sex           Female
smoker            No
day             Thur
time          Dinner
size               2
Name: 243, dtype: object

#### 3) 특정 행 범위 영역을 선택

In [26]:
# tips[0:3]라고 하면 0, 1, 2번째 행을 출력합니다. 데이터프레임의 첫 번째 행을 0번째 행이라고 가정하며 
# [0:3]이라고 입력했지만 3번째 행을 가져오지 않음에 유의하세요.
tips[0:3]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [27]:
tips.iloc[0:3]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [28]:
tips.loc[0:3]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2

In [16]:
tips.loc[0:3,['sex','day']]

      sex  day
0  Female  Sun
1    Male  Sun
2    Male  Sun
3    Male  Sun

In [17]:
tips.loc[0,['sex','day']]

sex    Female
day       Sun
Name: 0, dtype: object

In [30]:
#특정 인덱스 값과 특정 컬럼에 있는 값 가져오기. 
#.at을 이용할 수도 있습니다. 

tips.at[0,'sex']

'Female'

In [31]:
# 위치를 이용하여 선택하기: .iloc
tips.iloc[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [8]:
#인덱스 번호로 행뿐만 아니라 열도 선택할 수 있습니다. 

tips.iloc[3:5,0:2]

   total_bill   tip
3       23.68  3.31
4       24.59  3.61

In [2]:
#행과 열의 인덱스를 리스트로 넘겨줄 수도 있습니다. 
tips.iloc[[1,2,4],[0,2]]

NameError: name 'tips' is not defined

In [33]:
# 명시적으로 행이나 열 선택 인자에 ‘:’ 슬라이스를 전달하면 
tips.iloc[1:3,:]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3

In [24]:
tips.iloc[:,1:3]

      tip     sex
0    1.01  Female
1    1.66    Male
2    3.50    Male
3    3.31    Male
4    3.61  Female
..    ...     ...
239  5.92    Male
240  2.00  Female
241  2.00    Male
242  1.75    Male
243  3.00  Female

[244 rows x 2 columns]

In [34]:
#값 하나를 선택하기 위해서는 특정 행과 열을 지정
tips.iloc[1,1]

1.66

In [26]:
tips.iat[1,1]

1.66

### 4) 조건을 이용하여 선택

In [27]:
# 조건은 컬럼 데이터를 조건식과 비교하여 데이터를 추출하는 데이터베이스 SQL과 유사합니다
# 전체 데이터중 팁이 5 달러 이상
tips[tips.tip > 5]

     total_bill    tip     sex smoker   day    time  size
23        39.42   7.58    Male     No   Sat  Dinner     4
44        30.40   5.60    Male     No   Sun  Dinner     4
47        32.40   6.00    Male     No   Sun  Dinner     4
52        34.81   5.20  Female     No   Sun  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
85        34.83   5.17  Female     No  Thur   Lunch     4
88        24.71   5.85    Male     No  Thur   Lunch     2
116       29.93   5.07    Male     No   Sun  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
170       50.81  10.00    Male    Yes   Sat  Dinner     3
172        7.25   5.15    Male    Yes   Sun  Dinner     2
181       23.33   5.65    Male    Yes   Sun  Dinner     2
183       23.17   6.50    Male    Yes   Sun  Dinner     4
211       25.89   5.16    Male    Yes   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3
239       29.03   5.92    Male     No   Sat  Dinner     3

In [28]:
# and 조건 – 남자 손님이면서 비흡연자
tips[(tips['sex']=='Male') & (tips['smoker']=='No')]

     total_bill   tip   sex smoker  day    time  size
1         10.34  1.66  Male     No  Sun  Dinner     3
2         21.01  3.50  Male     No  Sun  Dinner     3
3         23.68  3.31  Male     No  Sun  Dinner     2
5         25.29  4.71  Male     No  Sun  Dinner     4
6          8.77  2.00  Male     No  Sun  Dinner     2
..          ...   ...   ...    ...  ...     ...   ...
232       11.61  3.39  Male     No  Sat  Dinner     2
233       10.77  1.47  Male     No  Sat  Dinner     2
235       10.07  1.25  Male     No  Sat  Dinner     2
239       29.03  5.92  Male     No  Sat  Dinner     3
242       17.82  1.75  Male     No  Sat  Dinner     2

[97 rows x 7 columns]

### 5) 특정 조건 선택

In [32]:
# 특정조건 선택시 ‘isin’ 함수를 많이 사용합니다. 
# 일요일 이면 True
[tips['day'].isin(['Sun'])]

[0       True
 1       True
 2       True
 3       True
 4       True
        ...
 239    False
 240    False
 241    False
 242    False
 243    False
 Name: day, Length: 244, dtype: bool]

In [37]:
# 팁을 1달러 지불한 고객
tips[tips['tip'].isin([1])]

     total_bill  tip     sex smoker  day    time  size
67         3.07  1.0  Female    Yes  Sat  Dinner     1
92         5.75  1.0  Female    Yes  Fri  Dinner     2
111        7.25  1.0  Female     No  Sat  Dinner     1
236       12.60  1.0    Male    Yes  Sat  Dinner     2

### 열 변수

#### 1) 열변수 추출

In [39]:
#데이터프레임에서 tips과 손님수 가지고 오기
tips.tip

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [40]:
tips['size']

0      2
1      3
2      3
3      2
4      4
      ..
239    3
240    2
241    2
242    2
243    2
Name: size, Length: 244, dtype: int64

#### 2) 여러 개 열 변수 한 번에 추출하기

In [9]:
#데이터프레임 'total_bill ', 'tip', 'day' 열 변수 추출
tips [['total_bill','tip','day']]

     total_bill   tip   day
0         16.99  1.01   Sun
1         10.34  1.66   Sun
2         21.01  3.50   Sun
3         23.68  3.31   Sun
4         24.59  3.61   Sun
..          ...   ...   ...
239       29.03  5.92   Sat
240       27.18  2.00   Sat
241       22.67  2.00   Sat
242       17.82  1.75   Sat
243       18.78  3.00  Thur

[244 rows x 3 columns]

#### 3) 파생변수 만들기

In [13]:
# 금액과 팁의 합계인 총액 (total)파생변수 만들기
tips['total'] = tips['total_bill'] + tips['tip']
tips['total']

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Name: total, Length: 244, dtype: float64

#### 4) 열 데이터 자료형 확인 및 변환

In [29]:
#데이터프레임 자료형 확인
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [42]:
#데이터프레임 열의 자료형 확인
type(tips.total_bill)

pandas.core.series.Series

In [30]:
#데이터프레임 자료형 변환
#카테고리형의 흡연 유무를 문자열으로 변환하여 삽입
tips['smoker_str']=tips['smoker'].astype(str)
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
smoker_str      object
dtype: object

#### 주의 :  자료형 중 카테고리형(category)과 문자열(object)의 차이

In [31]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
smoker_str    244 non-null object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 9.2+ KB

In [32]:
tips['smoker_str'] =tips['smoker'].astype('category')
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
smoker_str    244 non-null category
dtypes: category(5), float64(2), int64(1)
memory usage: 7.6 KB

### 데이터조작

#### 1)데이터 개수확인

In [55]:
#데이터프레임의 개수 확인 
tips.count( )

total_bill    244
tip           244
sex           244
smoker        244
day           244
time          244
size          244
smoker_str    244
total         244
dtype: int64

In [56]:
len(tips)

244

#### 2) 기타 보기

In [57]:
# 데이터프레임 인덱스 보기
tips.index

RangeIndex(start=0, stop=244, step=1)

In [58]:
# 데이터프레임 컬럼 보기
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'smoker_str', 'total'],
      dtype='object')

In [59]:
# 행, 열 구조 보기 
tips.values

array([[16.99, 1.01, 'Female', ..., 2, 'No', 18.0],
       [10.34, 1.66, 'Male', ..., 3, 'No', 12.0],
       [21.01, 3.5, 'Male', ..., 3, 'No', 24.51],
       ...,
       [22.67, 2.0, 'Male', ..., 2, 'Yes', 24.67],
       [17.82, 1.75, 'Male', ..., 2, 'No', 19.57],
       [18.78, 3.0, 'Female', ..., 2, 'No', 21.78]], dtype=object)

#### 3) 정렬

In [60]:
# 지급액'열(by=' total_bill ')을 기준으로 index(axis=0) 오름차순 정렬하기
tips.sort_values(by=['total_bill'], axis=0)

     total_bill    tip     sex smoker   day    time  size smoker_str  total
67         3.07   1.00  Female    Yes   Sat  Dinner     1        Yes   4.07
92         5.75   1.00  Female    Yes   Fri  Dinner     2        Yes   6.75
111        7.25   1.00  Female     No   Sat  Dinner     1         No   8.25
172        7.25   5.15    Male    Yes   Sun  Dinner     2        Yes  12.40
149        7.51   2.00    Male     No  Thur   Lunch     2         No   9.51
..          ...    ...     ...    ...   ...     ...   ...        ...    ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3        Yes  48.85
156       48.17   5.00    Male     No   Sun  Dinner     6         No  53.17
59        48.27   6.73    Male     No   Sat  Dinner     4         No  55.00
212       48.33   9.00    Male     No   Sat  Dinner     4         No  57.33
170       50.81  10.00    Male    Yes   Sat  Dinner     3        Yes  60.81

[244 rows x 9 columns]

In [61]:
# 지급액'열(by=' total_bill ')을 기준으로 index(axis=0) 내림차순 정렬하기 ascending=False 옵션 추가 
tips.sort_values(by=['total_bill'], axis=0, ascending=False)

     total_bill    tip     sex smoker   day    time  size smoker_str  total
170       50.81  10.00    Male    Yes   Sat  Dinner     3        Yes  60.81
212       48.33   9.00    Male     No   Sat  Dinner     4         No  57.33
59        48.27   6.73    Male     No   Sat  Dinner     4         No  55.00
156       48.17   5.00    Male     No   Sun  Dinner     6         No  53.17
182       45.35   3.50    Male    Yes   Sun  Dinner     3        Yes  48.85
..          ...    ...     ...    ...   ...     ...   ...        ...    ...
149        7.51   2.00    Male     No  Thur   Lunch     2         No   9.51
111        7.25   1.00  Female     No   Sat  Dinner     1         No   8.25
172        7.25   5.15    Male    Yes   Sun  Dinner     2        Yes  12.40
92         5.75   1.00  Female    Yes   Fri  Dinner     2        Yes   6.75
67         3.07   1.00  Female    Yes   Sat  Dinner     1        Yes   4.07

[244 rows x 9 columns]

In [62]:
#열 이름을 (알파벳 순서로) 정렬하기 : axis=1
tips.sort_index(axis=1)

      day     sex  size smoker smoker_str    time   tip  total  total_bill
0     Sun  Female     2     No         No  Dinner  1.01  18.00       16.99
1     Sun    Male     3     No         No  Dinner  1.66  12.00       10.34
2     Sun    Male     3     No         No  Dinner  3.50  24.51       21.01
3     Sun    Male     2     No         No  Dinner  3.31  26.99       23.68
4     Sun  Female     4     No         No  Dinner  3.61  28.20       24.59
..    ...     ...   ...    ...        ...     ...   ...    ...         ...
239   Sat    Male     3     No         No  Dinner  5.92  34.95       29.03
240   Sat  Female     2    Yes        Yes  Dinner  2.00  29.18       27.18
241   Sat    Male     2    Yes        Yes  Dinner  2.00  24.67       22.67
242   Sat    Male     2     No         No  Dinner  1.75  19.57       17.82
243  Thur  Female     2     No         No  Dinner  3.00  21.78       18.78

[244 rows x 9 columns]

#### 4) 행/열 합계

In [63]:
# 행 합계를 구할 때는 sum(axis=1) 메서드를 사용한다.
tips.sum(axis=1)

0      38.00
1      27.00
2      52.02
3      55.98
4      60.40
       ...
239    72.90
240    60.36
241    51.34
242    41.14
243    45.56
Length: 244, dtype: float64

In [64]:
# 열 합계를 구할 때는 sum(axis=0) 메서드를 사용하는데 axis인수의 디폴트 값이 0이므로 axis인수를 생략할 수 있다.
tips.sum()

total_bill                                              4827.77
tip                                                      731.58
sex           FemaleMaleMaleMaleFemaleMaleMaleMaleMaleMaleMa...
smoker        NoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNo...
day           SunSunSunSunSunSunSunSunSunSunSunSunSunSunSunS...
time          DinnerDinnerDinnerDinnerDinnerDinnerDinnerDinn...
size                                                        627
smoker_str    NoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNoNo...
total                                                   5559.35
dtype: object

#### 빈도분석

## 4. 데이터 병합과 연결

### 데이터 연결

In [78]:
import pandas as pd

# 시리즈를 데이터프레임의 새로운 행으로 연결하려면
s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
print(s1)
print(s2)
print(pd.concat([s1, s2]))

A    0
B    1
dtype: int64
c    2
d    3
e    4
dtype: int64
A    0
B    1
c    2
d    3
e    4
dtype: int64

In [79]:
#만약 옆으로 데이터 열을 연결하고 싶으면 axis=1로 인수를 설정한다.
df1 = pd.DataFrame([['Dog','3'], ['Bird','10'], ['Tiger','6'], ['Moose','3']],
                  index = ['0','1','2','3'],
                  columns = ['동물','나이'])
df1

      동물  나이
0    Dog   3
1   Bird  10
2  Tiger   6
3  Moose   3

In [80]:
df2 = pd.DataFrame([['집','0'], ['초원','0'], ['수풀','0'], ['초원','1']],
                  index = ['0','1','2','3'],
                  columns = ['사는곳','뿔의 개수'])
df2

  사는곳 뿔의 개수
0   집     0
1  초원     0
2  수풀     0
3  초원     1

In [61]:
pd.concat([df1, df2], axis=1)

      동물  나이 사는곳 뿔의 개수
0    Dog   3   집     0
1   Bird  10  초원     0
2  Tiger   6  수풀     0
3  Moose   3  초원     1

### 데이터 병합

In [81]:
import pandas as pd

# 병합용 데이터프레임 생성
df1 = pd.DataFrame({ '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['강감찬', '홍길동', '이순신', '장보고', '유관순', '신사임당', '세종대왕']
}, columns=['고객번호', '이름'])
df1

   고객번호    이름
0  1001   강감찬
1  1002   홍길동
2  1003   이순신
3  1004   장보고
4  1005   유관순
5  1006  신사임당
6  1007  세종대왕

In [84]:
df2 = pd.DataFrame({'고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [85]:
# inner join
pd.merge(df1, df2)

   고객번호    이름     금액
0  1001   강감찬  10000
1  1001   강감찬  20000
2  1001   강감찬  30000
3  1005   유관순  15000
4  1006  신사임당   5000

In [86]:
# Full join 방식은 키 값이 한쪽에만 있어도 데이터를 보여준다.
pd.merge(df1, df2, how='outer')

   고객번호    이름        금액
0  1001   강감찬   10000.0
1  1001   강감찬   20000.0
2  1001   강감찬   30000.0
3  1002   홍길동       NaN
4  1003   이순신       NaN
5  1004   장보고       NaN
6  1005   유관순   15000.0
7  1006  신사임당    5000.0
8  1007  세종대왕       NaN
9  1008   NaN  100000.0

In [87]:
# left, right 방식은 각각 첫번째, 혹은 두번째 데이터프레임의 키 값을 모두 보여준다.
pd.merge(df1, df2, how='left')

   고객번호    이름       금액
0  1001   강감찬  10000.0
1  1001   강감찬  20000.0
2  1001   강감찬  30000.0
3  1002   홍길동      NaN
4  1003   이순신      NaN
5  1004   장보고      NaN
6  1005   유관순  15000.0
7  1006  신사임당   5000.0
8  1007  세종대왕      NaN

In [88]:
pd.merge(df1, df2, how='right')

   고객번호    이름      금액
0  1001   강감찬   10000
1  1001   강감찬   20000
2  1001   강감찬   30000
3  1005   유관순   15000
4  1006  신사임당    5000
5  1008   NaN  100000

## 5. 단일변수 데이터 보기

### 범주형

In [65]:
# 관련 라이브러리 불러오기
import pandas as pd           #판다스
import matplotlib as mpl       #맷플롭립
import matplotlib.pylab as plt   #맷플롭립
import seaborn as sns          #시본 
import numpy as np           #넘파이

#데이터 준비 
tips = sns.load_dataset("tips")    # 팁 데이터

#데이터 보기
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [67]:
# 성별 범주형 빈도분석
tips['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [68]:
# 요일별 범주형 빈도분석
tips['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [69]:
# 성별, 요일별 교차분석 
pd.crosstab(tips['sex'],tips['day'])

day     Thur  Fri  Sat  Sun
sex
Male      30   10   59   58
Female    32    9   28   18

In [70]:
#여백 또는 누적값cumulatives 
pd.crosstab(tips['sex'],tips['day'], margins=True)

day     Thur  Fri  Sat  Sun  All
sex
Male      30   10   59   58  157
Female    32    9   28   18   87
All       62   19   87   76  244

In [71]:
# 전체 빈도 비율 확인 
pd.crosstab(tips['sex'],tips['day']).apply(lambda r: r/len(tips), axis=1)

day         Thur       Fri       Sat       Sun
sex
Male    0.122951  0.040984  0.241803  0.237705
Female  0.131148  0.036885  0.114754  0.073770

### 연속형

In [66]:
# tips 데이터 유형 확인 
# tips 데이터의 범주형(category) 변수는 sex,smoker,day,time 4개 
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [72]:
# tips 데이터 유형 확인 
# tips 데이터의 연속형(category) 변수는 total_bill,tip,size 3개
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [73]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000